export enum SubjectsByDiscipline {
    ECONOMIC_SCIENCES = 'Економічні науки',
    HUMANITIES = 'Гуманітарні науки',
    MATHEMATICAL_SCIENCES = 'Математичні науки',
    NATURAL_SCIENCES = 'Природничі науки',
    LAW = 'Право/Юриспруденція',
}


export const SubjectsEnum = {
    ECONOMIC_SCIENCES: [
        {id: 127, name: "1C: Бухгалтерія"},
        {id: 128, name: "Адміністративний менеджмент"},
        {id: 129, name: "Активний туризм"},
        {id: 130, name: "Аналіз господарської діяльності"},
        {id: 131, name: "Аналіз та оцінка потенціалу туристських територій"},
        {id: 132, name: "Аналіз фінансово-господарської діяльності"},
        {id: 133, name: "Антикризове управління"},
        {id: 134, name: "Антикризове управління в туризмі"},
        {id: 135, name: "Банк і банківські операції"},
        {id: 136, name: "Банкрутство"},
        {id: 137, name: "Бізнес інформатика"},
        {id: 138, name: "Бізнес планування"},
        {id: 139, name: "Бухгалтерська та податкова звітність"},
        {id: 140, name: "Бухгалтерський облік та аудит"},
        {id: 141, name: "Бюджетні системи"},
        {id: 142, name: "Валютно-кредитні відносини"},
        {id: 143, name: "Введення в бізнес"},
        {id: 144, name: "Виробничий маркетинг і менеджмент"},
        {id: 145, name: "Готельна справа"},
        {id: 146, name: "Готельний менеджмент"},
        {id: 147, name: "Гроші"},
        {id: 148, name: "Гроші, кредит, банки"},
        {id: 149, name: "Дендрологія"},
        {id: 150, name: "Державне та муніципальне управління"},
        {id: 151, name: "Державні і муніципальні фінанси"},
        {id: 152, name: "Економетрика"},
        {id: 153, name: "Економіка"},
        {id: 154, name: "Ділове спілкування і етикет"},
        {id: 155, name: "Джерела фінансування інноваційної діяльності організацій"},
        {id: 156, name: "Економіка готельного підприємства"},
        {id: 157, name: "Економіка підприємства"},
        {id: 158, name: "Економіка праці"},
        {id: 159, name: "Економіка туризму"},
        {id: 160, name: "Економіко-математичне моделювання"},
        {id: 161, name: "Економічна діагностика"},
        {id: 162, name: "Економічна історія"},
        {id: 163, name: "Економічна теорія"},
        {id: 164, name: "Економічний аналіз"},
        {id: 165, name: "Економічний аналіз фірми"},
        {id: 166, name: "Зовнішньоекономічна діяльність"},
        {id: 167, name: "Іміджеологія в туризмі"},
        {id: 168, name: "Інвестиції"},
        {id: 169, name: "Інвестиційний аналіз"},
        {id: 170, name: "Історія розвитку світового туризму"},
        {id: 171, name: "Комерційна діяльність"},
        {id: 172, name: "Контролінг підприємства"},
        {id: 173, name: "Корпоративне управління в туризмі"},
        {id: 174, name: "Корпоративні фінанси"},
        {id: 175, name: "Кредит"},
        {id: 176, name: "Логістика"},
        {id: 177, name: "Макроекономіка"},
        {id: 178, name: "Макрофінансовий аналіз"},
        {id: 179, name: "Маркетинг"},
        {id: 180, name: "Маркетинг готельного підприємства"},
        {id: 181, name: "Маркетингові комунікації"},
        {id: 182, name: "Менеджмент"},
        {id: 183, name: "Менеджмент організацій"},
        {id: 184, name: "Менеджмент туризму"},
        {id: 185, name: "Методи прийняття управлінських рішень"},
        {id: 186, name: "Міжнародна економіка"},
        {id: 187, name: "Мікроекономіка"},
        {id: 188, name: "Організація готельної справи"},
        {id: 189, name: "Організація послуг харчування"},
        {id: 190, name: "Підприємництво, торгівля та біржова діяльність"},
        {id: 191, name: "Податки"},
        {id: 192, name: "Політекономія"},
        {id: 193, name: "Промисловий маркетинг і менеджмент"},
        {id: 194, name: "Регіональна економіка"},
        {id: 195, name: "Рекламна діяльність"},
        {id: 196, name: "Стандартизація та сертифікація"},
        {id: 197, name: "Стратегічне управління"},
        {id: 198, name: "Стратегічний менеджмент"},
        {id: 199, name: "Страхування"},
        {id: 200, name: "Теорія управління"},
        {id: 201, name: "Технологія готельної справи"},
        {id: 202, name: "Тіньова економіка і економічна безпека"},
        {id: 203, name: "Торговельна справа"},
        {id: 204, name: "Туризм"},
        {id: 205, name: "Управління людськими ресурсами"},
        {id: 206, name: "Управління організацією"},
        {id: 207, name: "Управління персоналом"},
        {id: 208, name: "Фінанси"},
        {id: 209, name: "Фінансовий аналіз"},
        {id: 210, name: "Фінансовий менеджмент"},
        {id: 211, name: "Ціноутворення та оцінка бізнесу"},
    ],
    HUMANITIES: [
        {id: 252, name: "Антична філософія"},
        {id: 253, name: "Археологія"},
        {id: 254, name: "Бібліотекознавство"},
        {id: 255, name: "Бібліотечна справа"},
        {id: 256, name: "Видавнича справа"},
        {id: 257, name: "Географія макрорегіонів"},
        {id: 258, name: "Геополітика"},
        {id: 259, name: "Готельно-ресторанна справа"},
        {id: 260, name: "Деонтологія"},
        {id: 261, name: "Дедактика"},
        {id: 262, name: "Дизайн"},
        {id: 263, name: "Документознавство"},
        {id: 264, name: "Дошкільна педагогіка"},
        {id: 265, name: "Естетика"},
        {id: 266, name: "Етика"},
        {id: 267, name: "Загальна історія"},
        {id: 268, name: "Зарубіжна література"},
        {id: 269, name: "Західноєвропейська історія"},
        {id: 270, name: "Історія філософії"},
        {id: 271, name: "Історія культури"},
        {id: 272, name: "Історія України"},
        {id: 273, name: "Культурологія"},
        {id: 274, name: "Літературна творчість"},
        {id: 275, name: "Літературознавство"},
        {id: 276, name: "Музика"},
        {id: 277, name: "Педагогіка"},
        {id: 278, name: "Психологія"},
        {id: 279, name: "Релігієзнавство"},
        {id: 280, name: "Семіотика"},
        {id: 281, name: "Соціальна робота"},
        {id: 282, name: "Соціологія"},
        {id: 283, name: "Теорія літератури"},
        {id: 284, name: "Теорія та практика перекладу"},
        {id: 285, name: "Філологія"},
        {id: 286, name: "Філософія"},
        {id: 287, name: "Художнє оформлення тексту"},
    ],
    MATHEMATICAL_SCIENCES: [
        {id: 343, name: "Алгебра"}, {id: 344, name: "Вища математика"}, {id: 345, name: "Геометрія"}, {
            id: 346,
            name: "Дискретна математика"
        }, {id: 347, name: "Диференційні рівняння"}, {id: 348, name: "Економічна статистика"}, {
            id: 349,
            name: "Лінійна алгебра"
        }, {id: 350, name: "Математика"}, {id: 351, name: "Математична статистика"}, {
            id: 352,
            name: "Математичне програмування"
        }, {id: 353, name: "Математичний аналіз"}, {id: 354, name: "Прикладна математика"}, {
            id: 355,
            name: "Статистика"
        },
        {id: 356, name: "Теорія ігор"}, {id: 357, name: "Теорія ймовірності"},
        {
            id: 358,
            name: "Теорія прийняття рішень"
        },
    ],
    NATURAL_SCIENCES: [
        {id: 301, name: "Агрономія"}, {id: 302, name: "Анатомія"}, {id: 303, name: "Астрономія"}, {
            id: 304,
            name: "Безпека життєдіяльності"
        }, {id: 305, name: "Біологія"}, {id: 306, name: "Біохімія"}, {id: 307, name: "Ботаніка"}, {
            id: 308,
            name: "Валеологія"
        }, {id: 309, name: "Ветеринарія"}, {id: 310, name: "Генетика"}, {id: 311, name: "Географія"}, {
            id: 312,
            name: "Геодезія"
        }, {id: 313, name: "Геологія"}, {id: 314, name: "Грунтознавство"}, {id: 315, name: "Екологія"}, {
            id: 316,
            name: "Зоологія"
        }, {id: 317, name: "Імунологія"}, {id: 318, name: "Медицина"}, {id: 319, name: "Мікробіологія"}, {
            id: 320,
            name: "Природознавство"
        }, {id: 321, name: "Тваринництво"}, {
            id: 322,
            name: "Технологія виробництва і переробки продуктів тваринництва"
        }, {id: 323, name: "Фізіологія"}, {id: 324, name: "Хімія"}, {id: 325, name: "Цитологія"},
    ],
    LAW: [
        {id: 212, name: "Авторське право"}, {id: 213, name: "Аграрне право України"}, {
            id: 214,
            name: "Адвокатура"
        }, {id: 215, name: "Адміністративне право"}, {id: 216, name: "Актуальні проблеми теорії і права"}, {
            id: 217,
            name: "Антикорупційна діяльність"
        }, {id: 218, name: "Арбітражне право"}, {id: 219, name: "Бюджетне право"}, {
            id: 220,
            name: "Банківське право"
        }, {id: 221, name: "Біржове і фондове право"}, {id: 222, name: "Виборче право"}, {
            id: 223,
            name: "Вступ до спеціальності"
        }, {id: 224, name: "Господарське право"}, {id: 225, name: "Господарський процес"}, {
            id: 226,
            name: "Інтелектуальна власність"
        }, {id: 227, name: "Конституційне право"}, {id: 228, name: "Кримінальне право"},
    ],
};
const getSubjectById = (discipline: SubjectsByDiscipline, id: number) => {
    const subjects = SubjectsEnum[discipline];
    if (subjects) {
        return subjects.find(subject => subject.id === id);
    }
    return null;
};

const subject = getSubjectById(SubjectsByDiscipline.ECONOMIC_SCIENCES, 127);
console.log(subject);
